STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251fxx_cm33.h
/* Bit fields for RCC_USART3CFGR register */
#define RCC_USART3CFGR_USART3RST_Pos                 (0U)
#define RCC_USART3CFGR_USART3RST_Msk                 (0x1UL << RCC_USART3CFGR_USART3RST_Pos)                /*!< 0x00000001 */
#define RCC_USART3CFGR_USART3RST                     RCC_USART3CFGR_USART3RST_Msk                          /*!< USART3 reset */
#define RCC_USART3CFGR_USART3EN_Pos                  (1U)
#define RCC_USART3CFGR_USART3EN_Msk                  (0x1UL << RCC_USART3CFGR_USART3EN_Pos)                 /*!< 0x00000002 */
#define RCC_USART3CFGR_USART3EN                      RCC_USART3CFGR_USART3EN_Msk                           /*!< USART3 clock enable */
#define RCC_USART3CFGR_USART3LPEN_Pos                (2U)
#define RCC_USART3CFGR_USART3LPEN_Msk                (0x1UL << RCC_USART3CFGR_USART3LPEN_Pos)               /*!< 0x00000004 */
#define RCC_USART3CFGR_USART3LPEN                    RCC_USART3CFGR_USART3LPEN_Msk                         /*!< USART3 clock enable during CSleep  */

/* Bit fields for RCC_UART4CFGR register */
#define RCC_UART4CFGR_UART4RST_Pos                   (0U)
#define RCC_UART4CFGR_UART4RST_Msk                   (0x1UL << RCC_UART4CFGR_UART4RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART4CFGR_UART4RST                       RCC_UART4CFGR_UART4RST_Msk                            /*!< UART4 reset */
#define RCC_UART4CFGR_UART4EN_Pos                    (1U)
#define RCC_UART4CFGR_UART4EN_Msk                    (0x1UL << RCC_UART4CFGR_UART4EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART4CFGR_UART4EN                        RCC_UART4CFGR_UART4EN_Msk                             /*!< UART4 clock enable */
#define RCC_UART4CFGR_UART4LPEN_Pos                  (2U)
#define RCC_UART4CFGR_UART4LPEN_Msk                  (0x1UL << RCC_UART4CFGR_UART4LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART4CFGR_UART4LPEN                      RCC_UART4CFGR_UART4LPEN_Msk                           /*!< UART4 clock enable during CSleep */

/* Bit fields for RCC_UART5CFGR register */
#define RCC_UART5CFGR_UART5RST_Pos                   (0U)
#define RCC_UART5CFGR_UART5RST_Msk                   (0x1UL << RCC_UART5CFGR_UART5RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART5CFGR_UART5RST                       RCC_UART5CFGR_UART5RST_Msk                            /*!< UART5 reset */
#define RCC_UART5CFGR_UART5EN_Pos                    (1U)
#define RCC_UART5CFGR_UART5EN_Msk                    (0x1UL << RCC_UART5CFGR_UART5EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART5CFGR_UART5EN                        RCC_UART5CFGR_UART5EN_Msk                             /*!< UART5 clock enable */
#define RCC_UART5CFGR_UART5LPEN_Pos                  (2U)
#define RCC_UART5CFGR_UART5LPEN_Msk                  (0x1UL << RCC_UART5CFGR_UART5LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART5CFGR_UART5LPEN                      RCC_UART5CFGR_UART5LPEN_Msk                           /*!< UART5 clock enable during CSleep */

/* Bit fields for RCC_USART6CFGR register */
#define RCC_USART6CFGR_USART6RST_Pos                 (0U)
#define RCC_USART6CFGR_USART6RST_Msk                 (0x1UL << RCC_USART6CFGR_USART6RST_Pos)                /*!< 0x00000001 */
#define RCC_USART6CFGR_USART6RST                     RCC_USART6CFGR_USART6RST_Msk                          /*!< USART6 reset */
#define RCC_USART6CFGR_USART6EN_Pos                  (1U)
#define RCC_USART6CFGR_USART6EN_Msk                  (0x1UL << RCC_USART6CFGR_USART6EN_Pos)                 /*!< 0x00000002 */
#define RCC_USART6CFGR_USART6EN                      RCC_USART6CFGR_USART6EN_Msk                           /*!< USART6 clock enable */
#define RCC_USART6CFGR_USART6LPEN_Pos                (2U)
#define RCC_USART6CFGR_USART6LPEN_Msk                (0x1UL << RCC_USART6CFGR_USART6LPEN_Pos)               /*!< 0x00000004 */
#define RCC_USART6CFGR_USART6LPEN                    RCC_USART6CFGR_USART6LPEN_Msk                         /*!< USART6 clock enable during CSleep  */

/* Bit fields for RCC_UART7CFGR register */
#define RCC_UART7CFGR_UART7RST_Pos                   (0U)
#define RCC_UART7CFGR_UART7RST_Msk                   (0x1UL << RCC_UART7CFGR_UART7RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART7CFGR_UART7RST                       RCC_UART7CFGR_UART7RST_Msk                            /*!< UART7 reset */
#define RCC_UART7CFGR_UART7EN_Pos                    (1U)
#define RCC_UART7CFGR_UART7EN_Msk                    (0x1UL << RCC_UART7CFGR_UART7EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART7CFGR_UART7EN                        RCC_UART7CFGR_UART7EN_Msk                             /*!< UART7 clock enable */
#define RCC_UART7CFGR_UART7LPEN_Pos                  (2U)
#define RCC_UART7CFGR_UART7LPEN_Msk                  (0x1UL << RCC_UART7CFGR_UART7LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART7CFGR_UART7LPEN                      RCC_UART7CFGR_UART7LPEN_Msk                           /*!< UART7 clock enable during CSleep  */

/* Bit fields for RCC_UART8CFGR register */
#define RCC_UART8CFGR_UART8RST_Pos                   (0U)
#define RCC_UART8CFGR_UART8RST_Msk                   (0x1UL << RCC_UART8CFGR_UART8RST_Pos)                  /*!< 0x00000001 */
#define RCC_UART8CFGR_UART8RST                       RCC_UART8CFGR_UART8RST_Msk                            /*!< UART8 reset */
#define RCC_UART8CFGR_UART8EN_Pos                    (1U)
#define RCC_UART8CFGR_UART8EN_Msk                    (0x1UL << RCC_UART8CFGR_UART8EN_Pos)                   /*!< 0x00000002 */
#define RCC_UART8CFGR_UART8EN                        RCC_UART8CFGR_UART8EN_Msk                             /*!< UART8 clock enable */
#define RCC_UART8CFGR_UART8LPEN_Pos                  (2U)
#define RCC_UART8CFGR_UART8LPEN_Msk                  (0x1UL << RCC_UART8CFGR_UART8LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_UART8CFGR_UART8LPEN                      RCC_UART8CFGR_UART8LPEN_Msk                           /*!< UART8 clock enable during CSleep  */

